{'documents':

[{'address_name': '인천 서구 심곡동 337-2',
'category_group_code': 'FD6',
'category_group_name': '음식점',
'category_name': '음식점 > 양식 > 이탈리안',
'distance': '392',
'id': '27285022',
'phone': '032-561-5520',
'place_name': '달콤팩토리 본점',
'place_url': 'http://place.map.kakao.com/27285022',
'road_address_name': '인천 서구 승학로 229',
'x': '126.672359237787',
'y': '37.5429979121079'},
{'address_name': '인천 서구 심곡동 340-10',
'category_group_code': 'FD6',
'category_group_name': '음식점',
'category_name': '음식점 > 한식 > 육류,고기 > 갈비',
'distance': '198',
'id': '14088610',
'phone': '032-567-5665',
'place_name': '원갈비',
'place_url': 'http://place.map.kakao.com/14088610',
'road_address_name': '인천 서구 심곡로8번길 4',
'x': '126.670241858956',
'y': '37.5417738719211'},
{'address_name': '인천 서구 심곡동 334-23',
'category_group_code': 'FD6',
'category_group_name': '음식점',
'category_name': '음식점 > 한식 > 육류,고기 >  족발,보쌈',
'distance': '463',
'id': '1061490804',
'phone': '032-578-0912',
'place_name': '유진족발 본점',
'place_url': 'http://place.map.kakao.com/1061490804',
'road_address_name': '인천 서구 탁옥로 22',
'x': '126.67183019685625',
'y': '37.54391185460043'},
{'address_name': '인천 서구 심곡동 340-2',
'category_group_code': 'FD6',
'category_group_name': '음식점',
'category_name': '음식점 > 한식',
'distance': '201',
'id': '27273096',
'phone': '032-564-5820',
'place_name': '명태덕장',
'place_url': 'http://place.map.kakao.com/27273096',
'road_address_name': '인천 서구 심곡로 4',
'x': '126.669997278483',
'y': '37.5418128324882'},
{'address_name': '인천 서구 심곡동 333',
'category_group_code': 'FD6',
'category_group_name': '음식점',
'category_name': '음식점 > 일식 > 초밥,롤',
'distance': '486',
'id': '1093273249',
'phone': '032-567-0716',
'place_name': '도담초밥',
'place_url': 'http://place.map.kakao.com/1093273249',
'road_address_name': '인천 서구 탁 옥로 17',
'x': '126.671421402881',
'y': '37.5442386801761'},
{'address_name': '인천 서구 심곡동 336-5',
'category_group_code': 'FD6',
'category_group_name': '음식점',
'category_name': '음식점 > 중식 > 중화요리',
'distance': '290',
'id': '27334786',
'phone': '032-566-8822',
'place_name': '천왕성',
'place_url': 'http://place.map.kakao.com/27334786',
'road_address_name': '인천 서구 심곡로 17',
'x': '126.67133443380752',
'y': '37.54239770403832'},
{'address_name': '인천 서구 심곡동 257-15',
'category_group_code': 'FD6',
'category_group_name': '음식점',
'category_name': '음식점 > 치킨 > 교촌치킨',
'distance': '373',
'id': '11032675',
'phone': '032-567-0092',
'place_name': '교촌치킨 인천연희1호점',
'place_url': 'http://place.map.kakao.com/11032675',
'road_address_name': '인천 서구 심곡로 34',
'x': '126.67329212155698',
'y': '37.542106708982715'},
{'address_name': '인천 서구 심곡동 251-14',
'category_group_code': 'FD6',
'category_group_name': '음식점',
'category_name': '음식점 > 일식 > 참치회',
'distance': '417',
'id': '510229086',
'phone': '032-562-2737',
'place_name': '도참치',
'place_url': 'http://place.map.kakao.com/510229086',
'road_address_name': '인천 서구 심곡로 35-1',
'x': '126.673670016179',
'y': '37.5423744486758'},
{'address_name': '인천 서구 심곡동 257-18',
'category_group_code': 'FD6',
'category_group_name': '음식점',
'category_name': '음식점 > 치킨 > BHC치킨',
'distance': '435',
'id': '26800429',
'phone': '032-568-8255',
'place_name': 'BHC치킨 서구청점',
'place_url': 'http://place.map.kakao.com/26800429',
'road_address_name': '인천 서구 심곡로 40',
'x': '126.67416458122503',
'y': '37.54209470366078'},
{'address_name': '인천 서구 심곡동 251-15',
'category_group_code': 'FD6',
'category_group_name': '음식점',
'category_name': '음식점 > 한식 > 감자탕',
'distance': '404',
'id': '26541020',
'phone': '032-567-6777',
'place_name': '이와감자탕찜 본점',
'place_url': 'http://place.map.kakao.com/26541020',
'road_address_name': '인천 서구 심곡로 35',
'x': '126.67348446302',
'y': '37.542370331769'},
{'address_name': '인천 서구 심곡동 257-14',
'category_group_code': 'FD6',
'category_group_name': '음식점',
'category_name': '음식점 > 한식 > 한정식',
'distance': '364',
'id': '16145766',
'phone': '032-563-0106',
'place_name': '반상',
'place_url': 'http://place.map.kakao.com/16145766',
'road_address_name': '인천 서구 심곡로 32-1',
'x': '126.673136978345',
'y': '37.5421351115137'},
{'address_name': '인천 서구 심곡동 256-4',
'category_group_code': 'FD6',
'category_group_name': '음식점',
'category_name': '음식점 > 간식 > 떡,한과',
'distance': '464',
'id': '21316863',
'phone': '032-567-0845',
'place_name': ' 원앙떡집',
'place_url': 'http://place.map.kakao.com/21316863',
'road_address_name': '인천 서구 심곡로 44-1',
'x': '126.674667693541',
'y': '37.5419303075833'},
{'address_name': '인천 서구 심곡동 339-18',
'category_group_code': 'FD6',
'category_group_name': '음식점',
'category_name': '음식점 > 분식 > 떡볶이',
'distance': '267',
'id': '690411584',
'phone': '032-812-0055',
'place_name': '대박국물떡볶이 본점',
'place_url': 'http://place.map.kakao.com/690411584',
'road_address_name': '인천 서구 심곡로 18',
'x': '126.67136266989196',
'y': '37.54215181076901'},
{'address_name': '인천 서구 심곡동 258',
'category_group_code': 'FD6',
'category_group_name': '음식점',
'category_name': '음식점 > 한식 > 육류,고기 > 곱창,막창',
'distance': '289',
'id': '1739628819',
'phone': '032-562-3267',
'place_name': '국민낙곱새 서구점',
'place_url': 'http://place.map.kakao.com/1739628819',
'road_address_name': '인천 서구 승학로216번길 2',
'x': '126.672564391644',
'y': '37.5416253635117'},
{'address_name': '인천 서구 심곡동 336-4',
'category_group_code': 'FD6',
'category_group_name': '음식점',
'category_name': '음식점 > 치킨 > 굽네치킨',
'distance': '303',
'id': '10139636',
'phone': '032-566-9794',
'place_name': '굽네치킨 인천연희점',
'place_url': 'http://place.map.kakao.com/10139636',
'road_address_name': '인천 서구 심곡로 17-1',
'x': '126.671646720828',
'y': '37.5424012757974'}],
'meta': {'is_end': False,
'pageable_count': 45,
'same_name': None,
'total_count': 98}}

noraml
https://dapi.kakao.com/v2/local/search/category.json?category_group_code=FD6&rect=126.677,37.548,126.682,37.543&page=1

wrong
https://dapi.kakao.com/v2/local/search/category.json?category_group_code=FD6&rect=126.672,126.682,37.548,37.538&page=1

126.672,37.548 부터 126.682,37.538 까지의 범위를 계산합니다.
검색 결과가 너무 많습니다.
사분면을 나눠 새로 계산합니다.
126.677,37.548 부터 126.682,37.543 까지의 범위를 계산합니다.
검색 결과가 너무 많습니다.
사분면을 나눠 새로 계산합니다.
126.679,37.548 부터 126.682,37.546 까지의 범위를 계산합니다.
              분류    이름                 x                 y
0            NaN   NaN               NaN               NaN
1  음식점 > 한식 > 국수  국수궁전  126.681644905203  37.5477301121114
126.679,37.548 부터 126.682,37.546 범위의 계산을 끝냈습니다.
126.677,37.548 부터 126.679,37.546 까지의 범위를 계산합니다.
                         분류          이름                   x                  y
0                       NaN         NaN                 NaN                NaN
1  음식점 > 중식 > 중화요리 > 이비가 짬뽕  이비가짬뽕 인천본점  126.67726577389483  37.54636943447417
126.677,37.548 부터 126.679,37.546 범위의 계산을 끝냈습니다.
126.677,37.546 부터 126.679,37.543 까지의 범위를 계산합니다.
                분류   이름                 x                 y
0              NaN  NaN               NaN               NaN
1  음식점 > 중식 > 중화요리  희래등  126.678926174208  37.5431204658072
126.677,37.546 부터 126.679,37.543 범위의 계산을 끝냈습니다.
126.679,37.546 부터 126.682,37.543 까지의 범위를 계산합니다.
검색 결과가 너무 많습니다.
사분면을 나눠 새로 계산합니다.
126.681,37.546 부터 126.682,37.544 까지의 범위를 계산합니다.
                 분류      이름                 x                 y
0               NaN     NaN               NaN               NaN
1  음식점 > 한식 > 육류,고기  선두주먹고기  126.681450646718  37.5444499647455
126.681,37.546 부터 126.682,37.544 범위의 계산을 끝냈습니다.
126.679,37.546 부터 126.681,37.544 까지의 범위를 계산합니다.
         분류          이름                 x                 y
0       NaN         NaN               NaN               NaN
1  음식점 > 치킨  카우보이치킨 심곡점  126.680356045202  37.5442740156267
126.679,37.546 부터 126.681,37.544 범위의 계산을 끝냈습니다.
126.679,37.544 부터 126.681,37.543 까지의 범위를 계산합니다.
         분류          이름                 x                 y
0       NaN         NaN               NaN               NaN
1  음식점 > 한식  정정아식당 연희동점  126.680928280247  37.5438214613811
126.679,37.544 부터 126.681,37.543 범위의 계산을 끝냈습니다.
126.681,37.544 부터 126.682,37.543 까지의 범위를 계산합니다.
                 분류       이름                   x                  y
0               NaN      NaN                 NaN                NaN
1  음식점 > 한식 > 육류,고기  돈숙수초벌구이  126.68099862001563  37.54377840362539
126.681,37.544 부터 126.682,37.543 범위의 계산을 끝냈습니다.
현재 범위 내의 사분면의 계산을 마쳤습니다.
    분류   이름    x    y
0  NaN  NaN  NaN  NaN
126.679,37.546 부터 126.682,37.543 범위의 계산을 끝냈습니다.
현재 범위 내의 사분면의 계산을 마쳤습니다.
    분류   이름    x    y
0  NaN  NaN  NaN  NaN
126.67699999999999,37.548 부터 126.682,37.543 범위의 계산을 끝냈습니다.
126.672,37.548 부터 126.677,37.543 까지의 범위를 계산합니다.
검색 결과가 너무 많습니다.
사분면을 나눠 새로 계산합니다.
126.675,37.548 부터 126.677,37.545 까지의 범위를 계산합니다.
                            분류          이름                 x                 y
0                          NaN         NaN               NaN               NaN
1  음식점 > 한식 > 육류,고기 > 불고기,두루치기  백년불고기 서구청점  126.675039001585  37.5450199432609
126.675,37.548 부터 126.677,37.545 범위의 계산을 끝냈습니다.
126.672,37.548 부터 126.675,37.545 까지의 범위를 계산합니다.
검색 결과가 너무 많습니다.
사분면을 나눠 새로 계산합니다.
126.674,37.548 부터 126.675,37.546 까지의 범위를 계산합니다.
                 분류            이름                   x                  y
0               NaN           NaN                 NaN                NaN
1  음식점 > 한식 > 해물,생선  명가낙지마당 서구직영점  126.67423573860803  37.54602504279673
126.67399999999999,37.548 부터 126.675,37.546 범위의 계산을 끝냈습니다.
126.672,37.548 부터 126.674,37.546 까지의 범위를 계산합니다.
                 분류       이름                 x                 y
0               NaN      NaN               NaN               NaN
1  음식점 > 한식 > 육류,고기  태백산 서구점  126.673780932737  37.5460039653016
126.672,37.548 부터 126.67399999999999,37.546 범위의 계산을 끝냈습니다.
126.672,37.546 부터 126.674,37.545 까지의 범위를 계산합니다.
                 분류       이름                 x                 y
0               NaN      NaN               NaN               NaN
1  음식점 > 한식 > 육류,고기  태백산 서구점  126.673780932737  37.5460039653016
126.672,37.546 부터 126.67399999999999,37.545 범위의 계산을 끝냈습니다.
126.674,37.546 부터 126.675,37.545 까지의 범위를 계산합니다.
                 분류           이름                 x                 y
0               NaN          NaN               NaN               NaN
1  음식점 > 한식 > 육류,고기  제주도야지 인천서구점  126.674887178736  37.5455853504776
126.67399999999999,37.546 부터 126.675,37.545 범위의 계산을 끝냈습니다.
현재 범위 내의 사분면의 계산을 마쳤습니다.
    분류   이름    x    y
0  NaN  NaN  NaN  NaN
126.672,37.548 부터 126.675,37.545 범위의 계산을 끝냈습니다.
126.672,37.545 부터 126.675,37.543 까지의 범위를 계산합니다.
검색 결과가 너무 많습니다.
사분면을 나눠 새로 계산합니다.
126.674,37.545 부터 126.675,37.543 까지의 범위를 계산합니다.
                 분류   이름                   x                  y
0               NaN  NaN                 NaN                NaN
1  음식점 > 한식 > 육류,고기  육더쿠  126.67480590021697  37.54475891384412
126.67399999999999,37.545 부터 126.675,37.543 범위의 계산을 끝냈습니다.
126.672,37.545 부터 126.674,37.543 까지의 범위를 계산합니다.
                분류        이름                 x                 y
0              NaN       NaN               NaN               NaN
1  음식점 > 양식 > 이탈리안  달콤팩토리 본점  126.672359237787  37.5429979121079
126.672,37.545 부터 126.67399999999999,37.543 범위의 계산을 끝냈습니다.
126.672,37.543 부터 126.674,37.543 까지의 범위를 계산합니다.
                분류        이름                 x                 y
0              NaN       NaN               NaN               NaN
1  음식점 > 양식 > 이탈리안  달콤팩토리 본점  126.672359237787  37.5429979121079
126.672,37.543 부터 126.67399999999999,37.543 범위의 계산을 끝냈습니다.
126.674,37.543 부터 126.675,37.543 까지의 범위를 계산합니다.
---------------
https://dapi.kakao.com/v2/local/search/category.json?category_group_code=FD6&rect=126.674,37.543,126.675,37.543&page=1
{'documents': [], 'meta': {'is_end': True, 'pageable_count': 0, 'same_name': None, 'total_count': 0}}
구성요소가 없습니다. 검색값을 확인바랍니다.
---------------
126.67399999999999,37.543 부터 126.675,37.543 범위의 계산을 끝냈습니다.
현재 범위 내의 사분면의 계산을 마쳤습니다.
    분류   이름    x    y
0  NaN  NaN  NaN  NaN
126.672,37.545 부터 126.675,37.543 범위의 계산을 끝냈습니다.
126.675,37.545 부터 126.677,37.543 까지의 범위를 계산합니다.
검색 결과가 너무 많습니다.
사분면을 나눠 새로 계산합니다.
126.676,37.545 부터 126.677,37.544 까지의 범위를 계산합니다.
                  분류         이름                 x                 y
0                NaN        NaN               NaN               NaN
1  음식점 > 한식 > 죽 > 본죽  본죽 인천서구청점  126.676161267799  37.5440319312517
126.676,37.545 부터 126.677,37.544000000000004 범위의 계산을 끝냈습니다.
126.675,37.545 부터 126.676,37.544 까지의 범위를 계산합니다.
                       분류     이름                 x                 y
0                     NaN    NaN               NaN               NaN
1  음식점 > 한식 > 육류,고기 > 닭요리  성원닭갈비  126.675070335408  37.5440577662421
126.675,37.545 부터 126.676,37.544000000000004 범위의 계산을 끝냈습니다.
126.675,37.544 부터 126.676,37.543 까지의 범위를 계산합니다.
                분류   이름                 x                 y
0              NaN  NaN               NaN               NaN
1  음식점 > 중식 > 중화요리  영빈관  126.675598572762  37.5433204021419
126.675,37.544000000000004 부터 126.676,37.543 범위의 계산을 끝냈습니다.
126.676,37.544 부터 126.677,37.543 까지의 범위를 계산합니다.
               분류     이름                   x                 y
0             NaN    NaN                 NaN               NaN
1  음식점 > 한식 > 한정식  정복앤아구  126.67613290020944  37.5430038173262
126.676,37.544000000000004 부터 126.677,37.543 범위의 계산을 끝냈습니다.
현재 범위 내의 사분면의 계산을 마쳤습니다.
    분류   이름    x    y
0  NaN  NaN  NaN  NaN
126.675,37.545 부터 126.677,37.543 범위의 계산을 끝냈습니다.
현재 범위 내의 사분면의 계산을 마쳤습니다.
    분류   이름    x    y
0  NaN  NaN  NaN  NaN
126.672,37.548 부터 126.67699999999999,37.543 범위의 계산을 끝냈습니다.
126.672,37.543 부터 126.677,37.538 까지의 범위를 계산합니다.
검색 결과가 너무 많습니다.
사분면을 나눠 새로 계산합니다.
126.675,37.543 부터 126.677,37.54 까지의 범위를 계산합니다.
                   분류          이름                   x                   y
0                 NaN         NaN                 NaN                 NaN
1  음식점 > 패스트푸드 > 맥도날드  맥도날드 연희DT점  126.67635637129021  37.541304250681165
126.675,37.543 부터 126.677,37.54 범위의 계산을 끝냈습니다.
126.672,37.543 부터 126.675,37.54 까지의 범위를 계산합니다.
검색 결과가 너무 많습니다.
사분면을 나눠 새로 계산합니다.
126.674,37.543 부터 126.675,37.541 까지의 범위를 계산합니다.
                      분류       이름                   x                  y
0                    NaN      NaN                 NaN                NaN
1  음식점 > 한식 > 육류,고기 > 오리  가야촌오리마을  126.67483089975963  37.54291104061241
126.67399999999999,37.543 부터 126.675,37.541 범위의 계산을 끝냈습니다.
126.672,37.543 부터 126.674,37.541 까지의 범위를 계산합니다.
                분류        이름                 x                 y
0              NaN       NaN               NaN               NaN
1  음식점 > 양식 > 이탈리안  달콤팩토리 본점  126.672359237787  37.5429979121079
126.672,37.543 부터 126.67399999999999,37.541 범위의 계산을 끝냈습니다.
126.672,37.541 부터 126.674,37.54 까지의 범위를 계산합니다.
                분류        이름                x                 y
0              NaN       NaN              NaN               NaN
1  음식점 > 치킨 > 네네치킨  네네치킨 연희점  126.67244319703  37.5403600289729
126.672,37.541 부터 126.67399999999999,37.54 범위의 계산을 끝냈습니다.
126.674,37.541 부터 126.675,37.54 까지의 범위를 계산합니다.
---------------
https://dapi.kakao.com/v2/local/search/category.json?category_group_code=FD6&rect=126.674,37.541,126.675,37.54&page=1
{'documents': [], 'meta': {'is_end': True, 'pageable_count': 0, 'same_name': None, 'total_count': 0}}
구성요소가 없습니다. 검색값을 확인바랍니다.
---------------
126.67399999999999,37.541 부터 126.675,37.54 범위의 계산을 끝냈습니다.
현재 범위 내의 사분면의 계산을 마쳤습니다.
    분류   이름    x    y
0  NaN  NaN  NaN  NaN
126.672,37.543 부터 126.675,37.54 범위의 계산을 끝냈습니다.
126.672,37.54 부터 126.675,37.538 까지의 범위를 계산합니다.
---------------
https://dapi.kakao.com/v2/local/search/category.json?category_group_code=FD6&rect=126.672,37.54,126.675,37.538&page=1
{'documents': [], 'meta': {'is_end': True, 'pageable_count': 0, 'same_name': None, 'total_count': 0}}
구성요소가 없습니다. 검색값을 확인바랍니다.
---------------
126.672,37.54 부터 126.675,37.538 범위의 계산을 끝냈습니다.
126.675,37.54 부터 126.677,37.538 까지의 범위를 계산합니다.
---------------
https://dapi.kakao.com/v2/local/search/category.json?category_group_code=FD6&rect=126.675,37.54,126.677,37.538&page=1
{'documents': [], 'meta': {'is_end': True, 'pageable_count': 0, 'same_name': None, 'total_count': 0}}
구성요소가 없습니다. 검색값을 확인바랍니다.
---------------
126.675,37.54 부터 126.677,37.538 범위의 계산을 끝냈습니다.
현재 범위 내의 사분면의 계산을 마쳤습니다.
    분류   이름    x    y
0  NaN  NaN  NaN  NaN
126.672,37.543 부터 126.67699999999999,37.538 범위의 계산을 끝냈습니다.
126.677,37.543 부터 126.682,37.538 까지의 범위를 계산합니다.
                      분류            이름                 x                 y
0                    NaN           NaN               NaN               NaN
1  음식점 > 한식 > 해물,생선 > 추어  추오정남원추어탕 심곡점  126.681865723162  37.5426346761104
126.67699999999999,37.543 부터 126.682,37.538 범위의 계산을 끝냈습니다.
현재 범위 내의 사분면의 계산을 마쳤습니다.
    분류   이름    x    y
0  NaN  NaN  NaN  NaN
    분류   이름    x    y
0  NaN  NaN  NaN  NaN